backend-api/app/controllers/questions_controller.rb

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    # http://localhost:3000/questions/1
    @question = Question.find(params[:id])

SELECT "questions".* FROM "questions"   ORDER BY "questions"."created_at" ASC
---
   def show_all_questions
    # http://localhost:3000/
    @api_response = HTTParty.get("https://api.github.com/zen",
            :headers => { "Authorization" => 'token ' + ENV['GITHUB_TOKEN'], 'User-Agent' => 'xyz'})
    @questions = Question.all.order(:created_at)

INSERT INTO "questions" ("content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "something"], ["created_at", "2015-02-07 00:05:44.281299"], ["title", "somesnakes"], ["updated_at", "2015-02-07 00:05:44.281299"]]
---
  def create
    # questions?title=somesnakes&content=something
    @question = Question.new(title: params[:title], content: params[:content])#question_params)
    @question.save

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "questions" SET "updated_at" = $1, "votes" = $2 WHERE "questions"."id" = 1  [["updated_at", "2015-02-07 00:13:46.839868"], ["votes", 1]]
---
  def upvote
    # http://localhost:3000/questions/1/upvotes
    @question = Question.find(params[:question_id])
    @question.increment!(:votes)

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "questions" SET "updated_at" = $1, "votes" = $2 WHERE "questions"."id" = 1  [["updated_at", "2015-02-07 00:14:30.826440"], ["votes", 2]]
---
  def downvote
    # http://localhost:3000/questions/1/downvotes
    @question = Question.find(params[:question_id])
    @question.decrement!(:votes)